In [1]:
import pandas as pd
import numpy as np

In [2]:
# Axis indexes with duplicates value

In [3]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [4]:
obj.index.is_unique

False

In [5]:
obj['a']

a    0
a    1
dtype: int64

In [6]:
obj['c']

4

In [7]:
# in dataframe
df = pd.DataFrame(np.random.randn(4,3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -0.457922  1.589216  1.345706
a  0.964076 -0.883198 -0.711313
b  0.513061  1.252661 -0.719497
b -0.106046 -1.523491 -0.615501

In [8]:
df.loc['b']

          0         1         2
b  0.513061  1.252661 -0.719497
b -0.106046 -1.523491 -0.615501

In [10]:
# Summarizing and Computing descriptive Statistics

In [11]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                  [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [12]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [13]:
type(df.sum())

pandas.core.series.Series

In [14]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [16]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [17]:
df.sum(skipna=False)

one   NaN
two   NaN
dtype: float64

In [18]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [21]:
df.idxmax()

one    b
two    d
dtype: object

In [22]:
df.idxmin()

one    d
two    b
dtype: object

In [23]:
df.idxmax(axis='columns')

a    one
b    one
c    NaN
d    one
dtype: object

In [24]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [25]:
# producing multiple summary of statistics
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [28]:
# non -numeric data
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [29]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [30]:
# Corelation and Covariance

In [33]:
import pandas_datareader.data as web

In [37]:
all_data = {ticker: web.get_data_yahoo(ticker)
           for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

all_data

{'AAPL':                   High         Low        Open       Close      Volume  \
 Date
 2015-04-07  128.119995  125.980003  127.639999  126.010002  35012300.0
 2015-04-08  126.400002  124.970001  125.849998  125.599998  37329200.0
 2015-04-09  126.580002  124.660004  125.849998  126.559998  32484000.0
 2015-04-10  127.209999  125.260002  125.949997  127.099998  40188000.0
 2015-04-13  128.570007  126.610001  128.369995  126.849998  36365100.0
 ...                ...         ...         ...         ...         ...
 2020-03-30  255.520004  249.399994  250.740005  254.809998  41994100.0
 2020-03-31  262.489990  252.000000  255.600006  254.289993  49250500.0
 2020-04-01  248.720001  239.130005  246.500000  240.910004  44054600.0
 2020-04-02  245.149994  236.899994  240.339996  244.929993  41483500.0
 2020-04-03  245.699997  238.970001  242.800003  241.410004  32418200.0

              Adj Close
 Date
 2015-04-07  115.961906
 2015-04-08  115.584587
 2015-04-09  116.468048
 2015-04-10  116.964989
 2015-04-13  116.734917
 ...                ...
 2020-03-30  254.809998
 2020-03-31  254.289993
 2020-04-01  240.910004
 2020-04-02  244.929993
 2020-04-03  241.410004

 [1259 rows x 6 columns],
 'IBM':                   High         Low        Open       Close     Volume  \
 Date
 2015-04-07  163.839996  161.619995  161.669998  162.070007  3148000.0
 2015-04-08  163.550003  161.009995  161.720001  161.850006  2524300.0
 2015-04-09  162.470001  160.720001  161.699997  162.339996  2263500.0
 2015-04-10  163.330002  161.250000  162.339996  162.860001  2515700.0
 2015-04-13  164.000000  162.360001  162.369995  162.380005  3868900.0
 ...                ...         ...         ...         ...        ...
 2020-03-30  113.459999  107.809998  108.089996  112.930000  5564500.0
 2020-03-31  113.809998  110.169998  112.000000  110.930000  6343300.0
 2020-04-01  109.919998  104.519997  106.360001  105.139999  6112900.0
 2020-04-02  110.320000  105.139999  105.370003  110.000000  6328700.0
 2020-04-03  110.070000  104.919998  108.919998  106.339996  4538100.0

              Adj Close
 Date
 2015-04-07  130.156174
 2015-04-08  129.979523
 2015-04-09  130.372986
 2015-04-10  130.790588
 2015-04-13  130.405136
 ...                ...
 2020-03-30  112.930000
 2020-03-31  110.930000
 2020-04-01  105.139999
 2020-04-02  110.000000
 2020-04-03  106.339996

 [1259 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close      Volume  \
 Date
 2015-04-07   41.910000   41.310001   41.610001   41.529999  28809400.0
 2015-04-08   41.689999   41.040001   41.459999   41.419998  24753400.0
 2015-04-09   41.619999   41.250000   41.250000   41.480000  25723900.0
 2015-04-10   41.950001   41.410000   41.630001   41.720001  28022000.0
 2015-04-13   42.060001   41.389999   41.400002   41.759998  30276700.0
 ...                ...         ...         ...         ...         ...
 2020-03-30  160.600006  150.009995  152.440002  160.229996  63420300.0
 2020-03-31  164.779999  156.559998  159.399994  157.710007  77927200.0
 2020-04-01  157.750000  150.820007  153.000000  152.110001  57969900.0
 2020-04-02  155.479996  150.360001  151.860001  155.259995  49630700.0
 2020-04-03  157.380005  152.190002  155.100006  153.830002  41212700.0

              Adj Close
 Date
 2015-04-07   37.446957
 2015-04-08   37.347771
 2015-04-09   37.401886
 2015-04-10   37.618282
 2015-04-13   37.654354
 ...                ...
 2020-03-30  160.229996
 2020-03-31  157.710007
 2020-04-01  152.110001
 2020-04-02  155.259995
 2020-04-03  153.830002

 [1259 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close     Volume  \
 Date
 2015-04-07   541.204102   534.532471   536.606750   535.549622  1302800.0
 2015-04-08   542.360962   536.905945   536.905945   540.127075  1178500.0
 2015-04-09   540.466125   534.023865   539.548645   539.299377  1557800.0
 2015-04-10   540.805237   535.838867   540.805237   538.531433  1409400.0
 2015-04-13   542.570374   535.838867   536.935852   537.693787  1645300.0
 ...                 ...          ...          ...          ...        ...
 2020-03-30  1151.630005  1096.479980  1125.040039  1146.819946  2574100.0
 2020-03-31  1175.310059  1138.140015  1147.300049  1162.810059  2486400.0
 2020-04-01  1129.689941  1097.449951  1122.000000  1105.619995  2344200.0
 2020-04-02  1126.859985  1096.400024  1098.260010  1120.839966  1964900.0
 2020-04-03  1123.540039  1079.810059  1119.015015  1097.880005  2312200.0

               Adj Close
 Date
 2015-04-07   535.549622
 2015-04-08   540.127075
 2015-04-09   539.299377
 2015-04-10   538.531433
 2015-04-13   537.693787
 ...                 ...
 2020-03-30  1146.819946
 2020-03-31  1162.810059
 2020-04-01  1105.619995
 2020-04-02  1120.839966
 2020-04-03  1097.880005

 [1259 rows x 6 columns]}

In [38]:
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [39]:
price

                  AAPL         IBM        MSFT         GOOG
Date
2015-04-07  115.961906  130.156174   37.446957   535.549622
2015-04-08  115.584587  129.979523   37.347771   540.127075
2015-04-09  116.468048  130.372986   37.401886   539.299377
2015-04-10  116.964989  130.790588   37.618282   538.531433
2015-04-13  116.734917  130.405136   37.654354   537.693787
...                ...         ...         ...          ...
2020-03-30  254.809998  112.930000  160.229996  1146.819946
2020-03-31  254.289993  110.930000  157.710007  1162.810059
2020-04-01  240.910004  105.139999  152.110001  1105.619995
2020-04-02  244.929993  110.000000  155.259995  1120.839966
2020-04-03  241.410004  106.339996  153.830002  1097.880005

[1259 rows x 4 columns]

In [40]:
volume

                  AAPL        IBM        MSFT       GOOG
Date
2015-04-07  35012300.0  3148000.0  28809400.0  1302800.0
2015-04-08  37329200.0  2524300.0  24753400.0  1178500.0
2015-04-09  32484000.0  2263500.0  25723900.0  1557800.0
2015-04-10  40188000.0  2515700.0  28022000.0  1409400.0
2015-04-13  36365100.0  3868900.0  30276700.0  1645300.0
...                ...        ...         ...        ...
2020-03-30  41994100.0  5564500.0  63420300.0  2574100.0
2020-03-31  49250500.0  6343300.0  77927200.0  2486400.0
2020-04-01  44054600.0  6112900.0  57969900.0  2344200.0
2020-04-02  41483500.0  6328700.0  49630700.0  1964900.0
2020-04-03  32418200.0  4538100.0  41212700.0  2312200.0

[1259 rows x 4 columns]

In [43]:
# percentage changes of prices
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-03-30  0.028538  0.045358  0.070341  0.032511
2020-03-31 -0.002041 -0.017710 -0.015727  0.013943
2020-04-01 -0.052617 -0.052195 -0.035508 -0.049183
2020-04-02  0.016687  0.046224  0.020709  0.013766
2020-04-03 -0.014371 -0.033273 -0.009210 -0.020485

In [44]:
returns['GOOG'].corr(returns['AAPL'])

0.6315818584737236

In [45]:
returns['GOOG'].cov(returns['AAPL'])

0.00018765767496138158

In [46]:
# dataframe
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.526078  0.690268  0.631582
IBM   0.526078  1.000000  0.590746  0.519952
MSFT  0.690268  0.590746  1.000000  0.740075
GOOG  0.631582  0.519952  0.740075  1.000000

In [47]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000317  0.000144  0.000211  0.000188
IBM   0.000144  0.000235  0.000155  0.000133
MSFT  0.000211  0.000155  0.000294  0.000212
GOOG  0.000188  0.000133  0.000212  0.000278

In [48]:
returns.corrwith(volume)

AAPL   -0.145910
IBM    -0.103547
MSFT   -0.044944
GOOG   -0.047927
dtype: float64

In [49]:
# Unique values, value counts, and membership

In [2]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [4]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [6]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [7]:
pd.value_counts(obj.values, sort=False)

c    3
d    1
b    2
a    3
dtype: int64

In [8]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [9]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [10]:
# dataframe

In [11]:
data = pd.DataFrame({'Que1': [1, 3, 4, 3, 4],
                     'Que2': [2, 3, 1, 2, 3],
                     'Que3': [1, 5, 2, 4, 4]})
data

   Que1  Que2  Que3
0     1     2     1
1     3     3     5
2     4     1     2
3     3     2     4
4     4     3     4

In [13]:
data.apply(pd.value_counts).fillna(0)

   Que1  Que2  Que3
1   1.0   1.0   1.0
2   0.0   2.0   1.0
3   2.0   2.0   0.0
4   2.0   0.0   2.0
5   0.0   0.0   1.0